MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M2354SJFAE/mcu.h
#define EWDT_BASE            (APBPERIPH_BASE + 0x02000UL)
#define EWWDT_BASE           (APBPERIPH_BASE + 0x02100UL)


#define KS_BASE              (AHBPERIPH_BASE + 0x35000UL)
#define TAMPER_BASE          (AHBPERIPH_BASE + 0xBD000UL)
#define LCD_BASE             (AHBPERIPH_BASE + 0xBB000UL)



/**@}*/ /* PERIPHERAL */

/******************************************************************************/
/*                         Peripheral declaration                             */
/******************************************************************************/

/** @addtogroup PMODULE Peripheral Pointer
  The Declaration of Peripheral Pointer
  @{
 */

/** @addtogroup PMODULE_S Secure Peripheral Pointer
 The Declaration of Secure Peripheral Pointer
 @{
*/

#define PA_S                  ((GPIO_T *) GPIOA_BASE)                     /*!< GPIO PORTA Pointer                 */
#define PB_S                  ((GPIO_T *) GPIOB_BASE)                     /*!< GPIO PORTB Pointer                 */
#define PC_S                  ((GPIO_T *) GPIOC_BASE)                     /*!< GPIO PORTC Pointer                 */
#define PD_S                  ((GPIO_T *) GPIOD_BASE)                     /*!< GPIO PORTD Pointer                 */
#define PE_S                  ((GPIO_T *) GPIOE_BASE)                     /*!< GPIO PORTE Pointer                 */
#define PF_S                  ((GPIO_T *) GPIOF_BASE)                     /*!< GPIO PORTF Pointer                 */
#define PG_S                  ((GPIO_T *) GPIOG_BASE)                     /*!< GPIO PORTG Pointer                 */
#define PH_S                  ((GPIO_T *) GPIOH_BASE)                     /*!< GPIO PORTH Pointer                 */

#define UART0_S               ((UART_T *) UART0_BASE)                     /*!< UART0 Pointer                      */
#define UART1_S               ((UART_T *) UART1_BASE)                     /*!< UART1 Pointer                      */
#define UART2_S               ((UART_T *) UART2_BASE)                     /*!< UART2 Pointer                      */
#define UART3_S               ((UART_T *) UART3_BASE)                     /*!< UART3 Pointer                      */
#define UART4_S               ((UART_T *) UART4_BASE)                     /*!< UART4 Pointer                      */
#define UART5_S               ((UART_T *) UART5_BASE)                     /*!< UART5 Pointer                      */


#define TIMER0_S              ((TIMER_T *) TMR01_BASE)                    /*!< TIMER0 Pointer                      */
#define TIMER1_S              ((TIMER_T *) (TMR01_BASE + 0x100UL))        /*!< TIMER1 Pointer                      */
#define TIMER2_S              ((TIMER_T *) TMR23_BASE)                    /*!< TIMER2 Pointer                      */
#define TIMER3_S              ((TIMER_T *) (TMR23_BASE + 0x100UL))        /*!< TIMER3 Pointer                      */
#define TIMER4_S              ((TIMER_T *) TMR45_BASE)                    /*!< TIMER4 Pointer                      */
#define TIMER5_S              ((TIMER_T *) (TMR45_BASE + 0x100UL))        /*!< TIMER5 Pointer                      */

#define WDT_S                 ((WDT_T *) WDT_BASE)                        /*!< Watch Dog Timer Pointer             */

#define WWDT_S                ((WWDT_T *) WWDT_BASE)                      /*!< Window Watch Dog Timer Pointer      */

#define QSPI0_S               ((QSPI_T *) QSPI0_BASE)                     /*!< QSPI0 Pointer                       */
#define SPI0_S                ((SPI_T *) SPI0_BASE)                       /*!< SPI0 Pointer                        */
#define SPI1_S                ((SPI_T *) SPI1_BASE)                       /*!< SPI1 Pointer                        */
#define SPI2_S                ((SPI_T *) SPI2_BASE)                       /*!< SPI2 Pointer                        */
#define SPI3_S                ((SPI_T *) SPI3_BASE)                       /*!< SPI3 Pointer                        */

#define I2S0_S                ((I2S_T *) I2S0_BASE)                       /*!< I2S0 Pointer                        */

#define I2C0_S                ((I2C_T *) I2C0_BASE)                       /*!< I2C0 Pointer                        */
#define I2C1_S                ((I2C_T *) I2C1_BASE)                       /*!< I2C1 Pointer                        */
#define I2C2_S                ((I2C_T *) I2C2_BASE)                       /*!< I2C1 Pointer                        */

#define QEI0_S                ((QEI_T *) QEI0_BASE)                       /*!< QEI0 Pointer                        */
#define QEI1_S                ((QEI_T *) QEI1_BASE)                       /*!< QEI1 Pointer                        */

#define RTC_S                 ((RTC_T *) RTC_BASE)                        /*!< RTC Pointer                         */

#define ACMP01_S              ((ACMP_T *) ACMP01_BASE)                    /*!< ACMP01 Pointer                      */

#define CLK_S                 ((CLK_T *) CLK_BASE)                        /*!< System Clock Controller Pointer     */

#define DAC0_S                ((DAC_T *) DAC0_BASE)                       /*!< DAC0 Pointer                        */
#define DAC1_S                ((DAC_T *) DAC1_BASE)                       /*!< DAC1 Pointer                        */

#define EADC_S                ((EADC_T *) EADC_BASE)                      /*!< EADC Pointer                        */

#define SYS_S                 ((SYS_T *) SYS_BASE)                        /*!< System Global Controller Pointer    */

#define SYSINT_S              ((SYS_INT_T *) INT_BASE)                    /*!< Interrupt Source Controller Pointer */

#define FMC_S                 ((FMC_T *) FMC_BASE)                        /*!< Flash Memory Controller */

#define SDH0_S                ((SDH_T *)   SDH0_BASE)

#define CRPT_S                ((CRPT_T *) CRPT_BASE)                      /*!< Crypto Accelerator Pointer          */
#define TRNG_S                ((TRNG_T *)TRNG_BASE)                       /*!< True Random Number Pointer          */

#define BPWM0_S               ((BPWM_T *) BPWM0_BASE)                     /*!< BPWM0 Pointer                       */
#define BPWM1_S               ((BPWM_T *) BPWM1_BASE)                     /*!< BPWM1 Pointer                       */

#define EPWM0_S               ((EPWM_T *) EPWM0_BASE)                     /*!< EPWM0 Pointer                       */
#define EPWM1_S               ((EPWM_T *) EPWM1_BASE)                     /*!< EPWM1 Pointer                       */

#define SC0_S                 ((SC_T *) SC0_BASE)                         /*!< SC0 Pointer                         */
#define SC1_S                 ((SC_T *) SC1_BASE)                         /*!< SC1 Pointer                         */
#define SC2_S                 ((SC_T *) SC2_BASE)                         /*!< SC2 Pointer                         */

#define EBI_S                 ((EBI_T *) EBI_BASE)                        /*!< EBI Pointer                         */

#define CRC_S                 ((CRC_T *) CRC_BASE)                        /*!< CRC Pointer                         */

#define USBD_S                ((USBD_T *) USBD_BASE)                      /*!< USB Device Pointer                  */
#define USBH_S                ((USBH_T *) USBH_BASE)                      /*!< USBH Pointer                        */
#define OTG_S                 ((OTG_T *) OTG_BASE)                        /*!< OTG Pointer                         */

#define PDMA0_S               ((PDMA_T *) PDMA0_BASE)                     /*!< PDMA0 Pointer                        */
#define PDMA1_S               ((PDMA_T *) PDMA1_BASE)                     /*!< PDMA1 Pointer                        */

#define UI2C0_S               ((UI2C_T *) USCI0_BASE)                     /*!< UI2C0 Pointer                       */
#define UI2C1_S               ((UI2C_T *) USCI1_BASE)                     /*!< UI2C1 Pointer                       */

#define USPI0_S               ((USPI_T *) USCI0_BASE)                     /*!< USPI0 Pointer                       */
#define USPI1_S               ((USPI_T *) USCI1_BASE)                     /*!< USPI1 Pointer                       */

